---
kind: other
id: Methods.T:Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
source: html/15c96d57-46b5-1c29-b86a-6e1d387e06b7.htm
---
# FabricationPartRouteEnd Methods

Create fabrication routing end from centerline point on straight element.